# Практическое задание по теме: "Словари и множества"

# 2. Работа со словарями:
# +++++++++++++++++++++++

my_dict = {"Dim" : 1957, "Ra" : 1960, "Al" : 1980, "Da" : 1986}
print("Мой словарь:", my_dict)

print("Год рождения Al: ", my_dict["Al"])
# print("Год рождения какого-то Fin: ", my_dict["Fin"]) - выдает ошибку ключа KeyError: 'Fin' - нет такого в этом словаре

print("Год рождения Al: ", my_dict.get("Al"))
print("Год рождения какого-то Fin: ", my_dict.get("Fin", "Нет такого в этом словаре!"))

my_dict.update({"Nik" : 2010, "Ol" : 2013})
print("Мой дополненный словарь:", my_dict)

print("Удаляем предпоследнюю пару. Nik =", my_dict.pop("Nik"))
print("Мой остаток словаря:", my_dict)


# 3. Работа с множествами:
# +++++++++++++++++++++++

my_set = {0,"Z",9,"P",8,"A",7,"P",6,"E",6,"Z",7,"E",8,"R",5,"O",4,"Z",3,"R",2,"O",2,"B",3,"O",4,"Z",2,"A",1,"Q",2,"A",5}
print("Мое множество:",my_set)

my_set.add(11)                                  # добавляем 1 элемент
print("Мое дополненное множество 1:",my_set)

my_set.update({22,"BB",22,"BB",22,"BB"})        # добавляем несколько элементов
print("Мое дополненное множество 2:",my_set)

my_set.remove(6)
print("Мое уменьшенное множество:",my_set)

