# Практическая работа по уроку "Динамическая типизация"

name = "Dmitry"                     # Создайте переменную name и присвойте ей значение вашего имени
print("Name: ", name)               # Выведите значение переменной name на экран

age = 67                            # Создайте переменную age и присвойте ей значение вашего возраста
print("Age: ", age)                 # Выведите значение переменной age на экран

age = age + 3                       # Перезапишите в age текущее значение переменной age + новое
print("New Age: ", age)             # Выведите измененное значение переменной age на экран

is_student = True                   # Создайте переменную is_student и присвойте ей значение True
print("Is_student: ", is_student)   # Выведите значение переменной is_student на экран

