# Практическое задание по уроку "Базовые структуры данных" (Dmitry V.)
# !!! Старая версия задания !!!

# 1st program
#------------

print((9 ** 0.5) * 5)


# 2nd program
#------------

print((9.99 > 9.98) and (1000 != 1000.1))


# 3rd program
#------------

# 3.1
print(((1234 // 10) % 100) + ((5678 // 10) % 100))
# 3.2
print((int(1234 / 10) % 100) + (int(5678 / 10) % 100))


# 4th program
#------------

print((int(13.42) == (42.13 * 100) % 100) or (int(42.13) == (13.42 * 100) % 100))

# !!! Старая версия задания !!!
